app/controllers/movies_controller.rb

  def similar
    movie = Movie.find_by_id(params[:id])
    if not movie.director.present?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 8 LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'stronz'